Terraform Plan:
```data.aws_route53_zone._127cyber-name: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_policy.certbot_dns_route53: Refreshing state... [id=arn:aws:iam::941133421128:policy/CertbotDNSRoute53]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-04195779597826077]
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_vpc.main: Refreshing state... [id=vpc-06ef649a6525a65b9]
aws_acm_certificate._127cyber_wildcard_cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:941133421128:certificate/70446068-84a3-4580-b9be-43bb473653cd]
data.aws_route53_zone._127cyber-name: Read complete after 0s [id=Z03093112GERZ97ION6VA]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240401014022335500000004]
aws_iam_role_policy_attachment.certbot_dns_route53_attachment: Refreshing state... [id=ec2-instance-role-generic-20240401014021393200000002]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240401014021663400000003]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
data.aws_caller_identity.current: Read complete after 0s [id=941133421128]
aws_kms_key.siem_key: Refreshing state... [id=0ecbd38c-6753-4ea4-bb08-d9b62ca94086]
aws_route53_record._127cyber_wildcard_cert_validation["*.127cyber.com"]: Refreshing state... [id=Z03093112GERZ97ION6VA__138665dd27ee909427cb33f3f8ce3b81.127cyber.com._CNAME]
aws_acm_certificate_validation._127cyber_wildcard_cert_validation: Refreshing state... [id=2024-04-01 01:40:51.852 +0000 UTC]
aws_kms_alias.siem_key_alias: Refreshing state... [id=alias/siem_key]
aws_internet_gateway.gw: Refreshing state... [id=igw-03aec166a30d6c874]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/44a4a23eeb39fcfa]
aws_subnet.private1: Refreshing state... [id=subnet-01c5938938de2dfb8]
aws_subnet.public1: Refreshing state... [id=subnet-08922b97fe6e06001]
aws_subnet.public2: Refreshing state... [id=subnet-029b55baa9885ed9e]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/grafana-tg/51c6e07cca5de556]
aws_subnet.private2: Refreshing state... [id=subnet-0ed6ada1edfec2588]
aws_security_group.all: Refreshing state... [id=sg-013a4042151d0f939]
aws_route_table.public: Refreshing state... [id=rtb-0c4fa764ad8440369]
module.ec2_wazuh.aws_instance.this[0]: Refreshing state... [id=i-037b2056e26d8158e]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0d5c19e51c2483675]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0ac2e21973b6c3eed]
aws_nat_gateway.nat: Refreshing state... [id=nat-0f9e36891d8bfdf66]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/app/soc-alb/42a884563414045f]
aws_route_table.private: Refreshing state... [id=rtb-095db7dc1fbfda119]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-0c43bcae30183aa85]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-015488651220a4520]
aws_route53_record.grafana_record: Refreshing state... [id=Z03093112GERZ97ION6VA_dashboards.127cyber.com_A]
aws_route53_record.wazuh_record: Refreshing state... [id=Z03093112GERZ97ION6VA_wazuh.127cyber.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/app/soc-alb/42a884563414045f/921a1a9e09ad834f]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/42a884563414045f/921a1a9e09ad834f/71abe0bcaa4966ae]
aws_lb_listener_rule.grafana_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/42a884563414045f/921a1a9e09ad834f/e84a2c3521e01d32]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/44a4a23eeb39fcfa-20240421130548233800000001]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/grafana-tg/51c6e07cca5de556-20240421130548242700000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.nlb_wazuh will be created
  + resource "aws_lb" "nlb_wazuh" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + dns_name                                                     = (known after apply)
      + dns_record_client_routing_policy                             = "any_availability_zone"
      + enable_cross_zone_load_balancing                             = false
      + enable_deletion_protection                                   = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "network"
      + name                                                         = "wazuh-nlb"
      + name_prefix                                                  = (known after apply)
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-029b55baa9885ed9e",
          + "subnet-08922b97fe6e06001",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.listener_1514 will be created
  + resource "aws_lb_listener" "listener_1514" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 1514
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.listener_1515 will be created
  + resource "aws_lb_listener" "listener_1515" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 1515
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.listener_22 will be created
  + resource "aws_lb_listener" "listener_22" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 22
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.listener_55000 will be created
  + resource "aws_lb_listener" "listener_55000" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 55000
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.listener_9200 will be created
  + resource "aws_lb_listener" "listener_9200" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 9200
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tg_1514 will be created
  + resource "aws_lb_target_group" "tg_1514" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-1514"
      + name_prefix                        = (known after apply)
      + port                               = 1514
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ef649a6525a65b9"
    }

  # aws_lb_target_group.tg_1515 will be created
  + resource "aws_lb_target_group" "tg_1515" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-1515"
      + name_prefix                        = (known after apply)
      + port                               = 1515
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ef649a6525a65b9"
    }

  # aws_lb_target_group.tg_22 will be created
  + resource "aws_lb_target_group" "tg_22" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-22"
      + name_prefix                        = (known after apply)
      + port                               = 22
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ef649a6525a65b9"
    }

  # aws_lb_target_group.tg_55000 will be created
  + resource "aws_lb_target_group" "tg_55000" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-55000"
      + name_prefix                        = (known after apply)
      + port                               = 55000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ef649a6525a65b9"
    }

  # aws_lb_target_group.tg_9200 will be created
  + resource "aws_lb_target_group" "tg_9200" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "tg-9200"
      + name_prefix                        = (known after apply)
      + port                               = 9200
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-06ef649a6525a65b9"
    }

  # aws_lb_target_group_attachment.attach_wazuh_1514 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_1514" {
      + id               = (known after apply)
      + port             = 1514
      + target_group_arn = (known after apply)
      + target_id        = "i-037b2056e26d8158e"
    }

  # aws_lb_target_group_attachment.attach_wazuh_1515 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_1515" {
      + id               = (known after apply)
      + port             = 1515
      + target_group_arn = (known after apply)
      + target_id        = "i-037b2056e26d8158e"
    }

  # aws_lb_target_group_attachment.attach_wazuh_22 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_22" {
      + id               = (known after apply)
      + port             = 22
      + target_group_arn = (known after apply)
      + target_id        = "i-037b2056e26d8158e"
    }

  # aws_lb_target_group_attachment.attach_wazuh_55000 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_55000" {
      + id               = (known after apply)
      + port             = 55000
      + target_group_arn = (known after apply)
      + target_id        = "i-037b2056e26d8158e"
    }

  # aws_lb_target_group_attachment.attach_wazuh_9200 will be created
  + resource "aws_lb_target_group_attachment" "attach_wazuh_9200" {
      + id               = (known after apply)
      + port             = 9200
      + target_group_arn = (known after apply)
      + target_id        = "i-037b2056e26d8158e"
    }

  # aws_route53_record.nlb_dns will be created
  + resource "aws_route53_record" "nlb_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "listen.127cyber.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z03093112GERZ97ION6VA"
    }

  # aws_security_group.wazuh-nlb will be created
  + resource "aws_security_group" "wazuh-nlb" {
      + arn                    = (known after apply)
      + description            = "Security group for Wazuh NLB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 1514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1515
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1515
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 1516
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 1516
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 514
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 514
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 55000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 55000
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9200
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9200
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 9300
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 9400
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "220.233.86.20/32",
                  + "39.58.182.16/32",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "Wazuh-NLB"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Wazuh-NLB"
        }
      + tags_all               = {
          + "Name" = "Wazuh-NLB"
        }
      + vpc_id                 = "vpc-06ef649a6525a65b9"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```